{
  "Apple": [
    {
      "name": "iOS Engineer",
      "year": "Jan 2021 - Current",
      "description": [
        "Swift/Objective-C",
        "Triage incoming bug reports.",
        "Work closely with QA to reproduce issues and identify when they started occurring.",
        "Prioritize and assign issues for fixing",
        "Use tools to deep dive and isolate bugs and propose fixes for team review.",
        "Implement solutions"
      ]
    },
    {
      "name": "Genius",
      "year": "Oct 2017 - Dec 2020",
      "description": [
        "Earned recognition for consistency in delivering the highest number of completed customer appointments, while registering excellent customer satisfaction ratings.",
        "Played an essential role in enhancing the skill set of other technicians and specialists by training them on the proper application of the latest tools and methods for troubleshooting various hardware and software issues.",
        "Developed a comprehensive technical know-how for addressing complex problems."
      ]
    }
  ],
  "Freelance Software Engineer": [
    {
      "name": "",
      "year": "Feb 2018 - Nov 2020",
      "description": [
        "Developed and unit tested web, mobile, and native applications in various languages and frameworks including Java, Typescript, Javascript, Node.js, React, C, Swift in combination with several other technologies.",
        "A list of relevant projects along with GitHub repo's and README's can be found in the Projects section of my Portfolio ranging from personal projects to projects with groups up to 7 people."
      ]
    }
  ],
  "Encino Health & Wellness": [
    {
      "name": "Billing/Network Admin/Advertising",
      "year": "Jun 2013 - Aug 2016",
      "description": [
        "Managed marketing and advertisement and produced ads.",
        "Interacted with insurance companies to handle billing/submitted billing requests.",
        "Setup local network and all machines on network, including mass network storage and security."
      ]
    }
  ]
}
